app/Http/Controllers/Auth/LoginController.php

select * from `users` where `users`.`id` = '1' limit 1
update `users` set `yer` = '1' where `id` = '1'
insert into `sube_user` (`user_id`, `sube_id`, `date`) values ('1', '1', '2018-01-01 11:24:33')
---
     public function authenticated(){
         $user = User::find(Auth::user()->id);
         $user->yer= Input::get('sube');
         $user->update();


         $Subeler_User = new Subeler_User;
         $Subeler_User->user_id = \Auth::user()->id;
         $Subeler_User->sube_id = Input::get('sube');
         $Subeler_User->date=Carbon::now();
         $Subeler_User->save();