app/Http/Controllers/DashBoardController.php

select * from `teklifler` where (`Silindi` = '0' and `OnayDurumu` = '1') and year(`TeklifVerilenTarih`) > '2016-12-31' order by `TeklifVerilenTarih` desc
---
    public function onaybekleyen()
    {

            $onaybekleyen=Teklifler::where(['Silindi'=>0,'OnayDurumu'=>1])
            ->where('TeklifVerilenTarih','>',Carbon::now()->subDays(60))
            ->with('temsilci')
            ->with('tercuman')
            ->orderBy('TeklifVerilenTarih','DESC')->get();