app/Providers/AppServiceProvider.php

    public function boot()
    {
        Schema::defaultStringLength(191);



        setlocale(LC_TIME, 'tr_TR');
        Carbon::setLocale('tr');



        $temsilci = Temsilciler::orderBy('id', 'ASC')->get();
        view()->share('temsilci',$temsilci);

        $iptalsebepleri =IptalNedenleri::all();
        view()->share('iptalnedeni',$iptalsebepleri);


        $tercuman = TercumanVeritabani::where(['Silindi'=>0,'OnayDurumu'=>0]);
        view()->share('tercuman',$tercuman);


         $tercumanmali = TercumanVeritabani::where(['Silindi'=>0,'OnayDurumu'=>3]);
        view()->share('tercumanmali',$tercumanmali);

        $diller =Diller::orderBy('sirala', 'ASC')->get();
        view()->share('diller',$diller);

        $mahkemeler =AdliyeTakipMahkemeler::all();
        view()->share('mahkemeler',$mahkemeler);

        $subeler =Subeler::all();
---
select * from `temsilciler` order by `id` asc
select * from `diller` order by `sirala` asc
select * from `adliyetakipmahkemeler`
select * from `subeler`